app/Controllers/Admin.php

    public function lessonList()
    {

        $model = new CourseModel();
        helper('text');

        $data['lessons'] =$model->get()->getResultArray();
---
SELECT *
FROM `lessons`

    public function catalog()
    {
        $model = new CourseModel();
        helper('text');

        $data['lessons'] =$model->get()->getResultArray();
---
SELECT *
FROM `lessons`

    public function editor($id)
    {
        $url = "http://localhost:8080/fetchCode?fileName=Solution";

        $client = curl_init($url);
        curl_setopt($client,CURLOPT_POST,1);
        curl_setopt($client, CURLOPT_RETURNTRANSFER, true);
        $response = curl_exec($client);

        $result = json_decode($response,true);
        $data['codeBody']=$result['codeBody'];

        $db = db_connect();

        $model = new CourseModel($db);
        $usermodel = new UserModel($db);
        $builder = $db->table('lessons');        // 'mytablename' is the name of your table

        $builder->select('code-snippet', 'id');       // names of your columns
        $builder->where('id', $id);                // where clause
        $query = $builder->get()->getResult();

        $data['lessons'] =$model->find($id);
---
SELECT `code-snippet`
FROM `lessons`
WHERE `id` = '17'
SELECT *
FROM `lessons`
WHERE `lessons`.`id` = '17'

    public function adduser(){
        $model = new AdminModel();
        helper('text');

        $data['users'] =$model->get()->getResultArray();
---
SELECT *
FROM `admin-users`

    public function users()
    {

        $model = new userModel();
        helper('text');
        $email = 'jbareta2@gmail.com';
        $data['users'] =$model->get()->getResultArray();
---
SELECT *
FROM `users`

    public function admins()
    {
        $db = db_connect();
        $model = new AdminModel($db);
        helper('text');




        $builder = $db->table('admin-users');
        //$users = $builder->like('title', $this->request->getVar('search'))->get();
        $builder->where('role', 'moderator');
        $query = $builder->get()->getResultArray();
---
SELECT *
FROM `admin-users`
WHERE `role` = 'moderator'

        public function dashboard(){

            $db = db_connect();

            helper('form', 'url');
            $usermodel = new AdminModel($db);
            $coursemodel = new CourseModel($db);
            $student = new UserModel($db);


            $data['lessons'] =$coursemodel->countAllResults();
            $data['student'] =$student->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lessons`
SELECT COUNT(*) AS `numrows`
FROM `users`

        public function updateadminpassword($id){
            $db = db_connect();

            helper('form', 'url');
            $model = new AdminModel($db);
            $data['user'] =$model->find($id);
---
SELECT *
FROM `admin-users`
WHERE `admin-users`.`id` = '37'
 LIMIT 1