app/Controllers/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '28'
 LIMIT 1
---
    public function index()
    {
        $db = db_connect();

        helper('form', 'url');
        $usermodel = new UserModel($db);
        $forummodel = new ForumModel($db);
        $data['user']=$usermodel->where("users.id", session("id"))->first();

SELECT *
FROM `users`
WHERE `users`.`id` = '29'
---
    public function editprofile($id){
        $db = db_connect();

        helper('form', 'url');
        $usermodel = new UserModel($db);
        $forummodel = new ForumModel($db);
        $usermodel = new UserModel($db);
        $data['user'] =$usermodel->find($id);